app/Models/AuthModel.php

INSERT INTO `tbluseraccount` (`username`, `password`) VALUES ('', '$2y$10$..vxHJplC18mC2anNSget.TQs7rFlH3JKq3/6HclVsyLrHfgkN37S')
---
    public function insert_data($data)
    {
        $builder = $this->db->table('tbluseraccount');
        $builder->insert($data);